<a href="https://colab.research.google.com/github/DeepakR19/INTERNSOFTcodefiles/blob/main/Panda1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas
pandas.__version__

'1.1.5'

In [2]:
import numpy as np
import pandas as pd

In [3]:
c = pd.Series([890, 678, 536, 356])
c

0    890
1    678
2    536
3    356
dtype: int64

In [5]:
c.values

array([890, 678, 536, 356])

In [6]:
c.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
Marvel = pd.Series([890, 678, 536, 356], index=['Thor', 'spiderman', 'loki', 'Tony'])
Marvel

Thor         890
spiderman    678
loki         536
Tony         356
dtype: int64

In [8]:
Marvel['Tony']

356

In [9]:
Marvel.name = 'Endgame'
Marvel.index.name = 'Nothing'
Marvel

Nothing
Thor         890
spiderman    678
loki         536
Tony         356
Name: Endgame, dtype: int64

In [10]:
np.log(Marvel)

Nothing
Thor         6.791221
spiderman    6.519147
loki         6.284134
Tony         5.874931
Name: Endgame, dtype: float64

In [12]:
Marvel[Marvel>200]

Nothing
Thor         890
spiderman    678
loki         536
Tony         356
Name: Endgame, dtype: int64

In [15]:
d = {"Province":["K", "r", "g", "d"],
     "Year":[2002, 2003, 2004, 2005],
     "Literacy":[0.3, 0.4, 0.5, 0.7]}
print(d)
d = pd.DataFrame(d)
d

{'Province': ['K', 'r', 'g', 'd'], 'Year': [2002, 2003, 2004, 2005], 'Literacy': [0.3, 0.4, 0.5, 0.7]}

  Province  Year  Literacy
0        K  2002       0.3
1        r  2003       0.4
2        g  2004       0.5
3        d  2005       0.7

In [16]:
df = pd.DataFrame(d, columns=["Year", "Province", "Literacy"])
df

   Year Province  Literacy
0  2002        K       0.3
1  2003        r       0.4
2  2004        g       0.5
3  2005        d       0.7

In [29]:
df["Nonsense"] = df.Year / df.Literacy
df['Snlo'] = pd.Series(range(5), index=[0, 1, 2,3,4])
df

   Year Province  Literacy     Nonsense  Snlo
0  2002        K       0.3  6673.333333     0
1  2003        r       0.4  5007.500000     1
2  2004        g       0.5  4008.000000     2
3  2005        d       0.7  2864.285714     3

In [30]:
df.to_dict()

{'Literacy': {0: 0.3, 1: 0.4, 2: 0.5, 3: 0.7},
 'Nonsense': {0: 6673.333333333334,
  1: 5007.5,
  2: 4008.0,
  3: 2864.2857142857147},
 'Province': {0: 'K', 1: 'r', 2: 'g', 3: 'd'},
 'Snlo': {0: 0, 1: 1, 2: 2, 3: 3},
 'Year': {0: 2002, 1: 2003, 2: 2004, 3: 2005}}

In [31]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy     Nonsense  Snlo
0  2002        K       0.3  6673.333333     0
1  2003        r       0.4  5007.500000     1
2  2004        g       0.5  4008.000000     2
3  2005        d       0.7  2864.285714     3

In [33]:
d = [{'a': i, 'b': 10* i}for i in range(6)]
print(d)
pd.DataFrame(d)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50